---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetArea
source: html/42ca556f-29e7-9d30-6e39-c50fc45547c1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetArea Property

"State"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryParamPresetArea { get; }
```